# SketchPlane Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveElement..::..SketchPlane Property
CurveElement Class See Also
---
The sketch plane the curve element lies in.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual SketchPlane SketchPlane { get; set; }
```

Visual Basic
---
```text
Public Overridable Property SketchPlane As SketchPlane
	Get
	Set
```

Visual C++
---
```text
public:
virtual property SketchPlane^ SketchPlane {
	SketchPlane^ get ();
	void set (SketchPlane^ value);
}
```

# Remarks
The new sketch plane must be parallel to the existing sketch plane. Setting this property is not permitted for detail curves because they must be placed only on view-specific planes.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown if the argument is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown if the CurveElement is CurveByPoints or belongs to a Path3d element. -- or -- Thrown if the sketch plane is set on a DetailCurve. --or-- Thrown if the sketch plane is not parallel to the existing plane. -- or -- Thrown if the sketch plane is not suitable. -- or -- Thrown if the CurveElement belongs to a sketch-based element. -- or -- Thrown if modifying the sketch plane is not allowed. -- or -- Thrown if the CurveElement cannot be moved out of its sketch plane. |

# See Also
CurveElement Class
Autodesk.Revit.DB Namespace